tap "1password/tap"
tap "charmbracelet/tap"
tap "cmacrae/formulae"
tap "dracula/install"
tap "ehfeng/ted"
tap "epk/epk"
tap "evanpurkhiser/personal"
tap "felixkratz/formulae"
tap "finefindus/tap"
tap "fsouza/prettierd"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "manaflow-ai/cmux"
tap "metafates/mangal"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "oven-sh/bun"
tap "qmk/qmk"
tap "romkatv/powerlevel10k"
tap "tidbyt/tidbyt"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# GNU debugger for arm-none-eabi cross development
brew "arm-none-eabi-gdb"
# High performance message passing library
brew "open-mpi"
# Collection of portable C++ source libraries
brew "boost"
# Atmel AVR MCU programmer
brew "avrdude"
# Core application library for C
brew "glib"
# Vector graphics library with cross-device output support
brew "cairo"
# International domain name library (IDNA2008, Punycode and TR46)
brew "libidn2"
# Validating, recursive, caching DNS resolver
brew "unbound"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# OpenType text shaping engine
brew "harfbuzz"
# Image processing and image analysis library
brew "leptonica"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Light HTTP/1.1 server library
brew "libmicrohttpd"
# Reliable Internet Stream Transport (RIST)
brew "librist"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Formatting tools for C, C++, Obj-C, Java, JavaScript, TypeScript
brew "clang-format"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Dependency manager for Cocoa projects
brew "cocoapods"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Apjanke's fork of the classic cowsay project
brew "cowsay"
# Collection of reusable C++ library artifacts developed at Facebook
brew "folly"
# C++14 implementation of the TLS-1.3 standard
brew "fizz"
# Modular, composable client/server abstractions framework
brew "wangle"
# Facebook's branch of Apache Thrift, including a new C++ server
brew "fbthrift"
# Thrift functions for querying information from a service
brew "fb303"
# Shared library for Watchman and Eden projects
brew "edencommon"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# AST-based pattern checker for JavaScript
brew "eslint"
# C routines to compute the Discrete Fourier Transform
brew "fftw"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Real-time software synthesizer based on the SoundFont 2 specs
brew "fluid-synth"
# Infamous electronic fortune-cookie generator
brew "fortune"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Render markdown on the CLI
brew "glow"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Generate introspection data for GObject libraries
brew "gobject-introspection"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# Tool for glamorous shell scripts
brew "gum"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie", link: false
# Configurable static site generator
brew "hugo"
# Get events and tasks from the macOS calendar database
brew "ical-buddy"
# Tool to report network interface bandwidth
brew "ifstat"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Library for complex text layout
brew "libraqm"
# Library that implements the rsync remote-delta algorithm
brew "librsync"
# Next-gen compiler infrastructure
brew "llvm"
# Rainbows and unicorns in your console!
brew "lolcat"
# Music Player Daemon
brew "mpd", restart_service: :changed
# Ncurses-based client for the Music Player Daemon
brew "ncmpcpp"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim", args: ["HEAD"]
# High-level interpreted language for numerical computing
brew "octave"
# Command-line Git information tool
brew "onefetch"
# Development kit for the Java programming language
brew "openjdk"
# Generate clients, server & docs from an OpenAPI spec (v2, v3)
brew "openapi-generator"
# Development kit for the Java programming language
brew "openjdk@17"
# Tool for creating identical machine images for multiple platforms
brew "packer"
# Friendly PIL fork (Python Imaging Library)
brew "pillow"
# Animated pipes terminal screensaver
brew "pipes-sh"
# Fast, disk space efficient package manager
brew "pnpm"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Cowsay but with ponies
brew "ponysay"
# Theme for zsh
brew "powerlevel10k"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9", link: false
# QR Code generation
brew "qrencode"
# Persistent key-value database, with built-in net interface
brew "redis"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Rust toolchain installer
brew "rustup"
# Autoformat shell script source code
brew "shfmt"
# Enterprise search platform from the Apache Lucene project
brew "solr"
# Cross-shell prompt for astronauts
brew "starship"
# Opinionated Lua code formatter
brew "stylua"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Next generation frontend tooling. It's fast!
brew "vite"
# Watch files and take action when they change
brew "watchman"
# JavaScript package manager
brew "yarn"
# Download YouTube videos from the command-line
brew "youtube-dl"
# UNIX shell (command interpreter)
brew "zsh"
# AI on the command line
brew "charmbracelet/tap/mods"
# Terminal editor for tabular data
brew "ehfeng/ted/ted"
# A CLI wrapper for libkeyfinder. Making DJs lives easier.
brew "evanpurkhiser/personal/keyfinder-cli"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# Is a small cli program written in rust to easily convert images to ascii art
brew "finefindus/tap/artem"
# prettier, on SPEED!
brew "fsouza/prettierd/prettierd"
# Simple hotkey-daemon for macOS.
brew "koekeishiya/formulae/skhd"
# A tiling window manager for macOS based on binary space partitioning.
brew "koekeishiya/formulae/yabai"
# The ultimate CLI manga downloader!
brew "metafates/mangal/mangal"
# Pre-built GNU toolchain for Arm Cortex-M and Cortex-R processors
brew "osx-cross/arm/arm-gcc-bin@10", link: false
# GNU compiler collection for AVR 8-bit and 32-bit Microcontrollers
brew "osx-cross/avr/avr-gcc@9"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Quantum Mechanical Keyboard (QMK) Firmware
brew "qmk/qmk/qmk"
# App runtime and UX toolkit for pixel-based apps.
brew "tidbyt/tidbyt/pixlet"
# Command-line interface for 1Password
cask "1password-cli"
# Multi-track audio editor and recorder
cask "audacity"
# File manager
cask "bloom"
# Terminal-based AI coding assistant
cask "claude-code"
# Ghostty-based terminal with vertical tabs and notifications for AI coding agents
cask "cmux"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# Dark theme for Steam
cask "dracula/install/dracula-steam"
# Collaborative team software
cask "figma"
cask "font-caskaydia-cove-nerd-font"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "epk/epk/font-sf-mono-nerd-font"
cask "font-victor-mono-nerd-font"
# Desktop automation application
cask "hammerspoon"
# Testing client for REST, GraphQL, and HTTP APIs
cask "httpie-desktop"
# Free and open-source media player
cask "iina"
# Application launcher
cask "leader-key"
# Colour picker for colours onscreen
cask "pika"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# View Spaces / Virtual Desktops in the menu bar
cask "spaceman"
# Configurator of compatible keyboards in real time
cask "vial"
# Open-source code editor
cask "visual-studio-code"
vscode "alexanderte.dainty-nord-vscode"
vscode "bmewburn.vscode-intelephense-client"
vscode "eyhn.vscode-vibrancy"
vscode "github.copilot"
vscode "golang.go"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "vscodevim.vim"
go "github.com/go-delve/delve/cmd/dlv"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
cargo "lsd"
